var data = {
  "item1":
    {
      "menu":"Фильмы",
      "contentClass":"films",
      "text":"Фильм (англ. film — плёнка), а также — кино, кинофильм, телефильм, кинокартина — отдельное произведение киноискусства. В технологическом плане фильм представляет собой совокупность движущихся изображений (монтажных кадров), связанных единым сюжетом. Каждый монтажный кадр состоит из последовательности фотографических или цифровых неподвижных изображений (кадриков), на которых зафиксированы отдельные фазы движения. Фильм, как правило, имеет звуковое сопровождение."
    },
    "item2":
    {
      "menu": "Сериалы",
      "contentClass":"tv-series",
      "text": "Сериа́л (англ. Serial, также телесериал, последовательная программа) — разновидность телевизионных и радио- передач, которые состоят из отдельных, последовательных эпизодов. Наиболее известным форматом сериалов являются мыльные оперы, начавшие своё существование в 1930-х годах на американском радио."
    },
    "item3":
    {
      "menu": "Ток-шоу",
      "contentClass":"talk-show",
      "text": "Ток-шо́у (от англ. talk show [tɔ:k ʃoʊ] — разговорное шоу) — вид телепередачи, в котором несколько приглашённых участников ведут обсуждение предлагаемой ведущим темы. Как правило, при этом присутствуют приглашённые в студию зрители. Иногда зрителям предоставляется возможность задать вопрос или высказать своё мнение."
    },
    "item4":
    {
      "menu": "Мультфильмы",
      "contentClass":"cartoon",
      "text": "Мультипликационный фильм, мультфильм (от слияния лат. multiplicatio — умножение и англ. film — плёнка; разг. мультик) — это фильм, выполненный при помощи средств покадровой отрисовки (включая 3D-моделирование) и предназначенный для демонстрации в кинотеатре, трансляции по телевидению, просмотре на экране компьютера и других электронных устройствах."
    },
    "item5":
    {
      "menu": "Новости",
      "contentClass":"news",
      "text": "Но́вости — оперативная информация, которая представляет политический, социальный или экономический интерес для аудитории в своей свежести, то есть сообщения о событиях, произошедших недавно или происходящих в данный момент. Также новостями называют программы (собрание нескольких новостей) на телевидении и радио, а в печатной прессе или на веб-сайтах — сводки новостей, в специальной рубрике в газете."
    }
}
