let pages = [ {
	articleTitle: "Ту-22М3 (Backfire)",
	articleText: "Сверхзвуковой дальний бомбардировщик «Ту-22М3» предназначен для поражения целей по всему евразийскому континенту и в близлежащих морях. Недавно бомбардировщики прошли модернизацию и получили совершенно новую бортовую электронику. Проведенная модернизация повысила возможности бомбардировщика в прорыве ПВО типа «Иджис», еще модернизированный бомбардировщик часто называют убийцей ЕвроПро. Кроме того, одно из предназначений стратега — уничтожение авианосцев. В арсенал вооружения сверхзвукового бомбардировщика введена крылатая ракета Х-32, развивающая скорость более 4000 километров в час, обладающая дальностью полета до 1000 километров. Скорость самого бомбардировщика-ракетоносца достигает 2300 км/ч. Самолеты семейства «Ту-22М» состояли на вооружении ВВС Украины. Однако на данный момент Украина демонтировала все свои 60 «Ту-22М» (17 «Ту-22М2» и 43 «Ту-22М3»).",
	articleImage: "img/aircraft/tu22/tu22m3-3.jpg",
	articleImage2: "img/aircraft/tu22/800px-tu-22_scrapyard.jpg"
}, 
{
	articleTitle: "Rockwell B-1 Lancer",
	articleText: "Rockwell B-1 Lancer — единственный находящийся на вооружении ВВС США самолет с изменяемым стреловидным крылом. В конструкции бомбардировщика использованы композитные материалы, снижающие эффективную площадь рассеяния. Из композитов изготовлены передние горизонтальные поверхности, кромки крыла, стабилизатора и воздухозаборников, а также створки бомбоотсеков. Стыки обшивки планера заклеены специальной лентой, которая затем покрывается краской. По заявлению создателей, В-1 обладает уникальными характеристиками начальной выживаемости, превосходя по некоторым критериям В-52 в 2−3 раза. Бомбардировщик Rockwell B-1 В Lancer может развивать скорость в 1328 км/ч и нести 56 тонн бомб или ракет.",
	articleImage: "img/aircraft/b1b/1363887384_rockwell_b-1b_rollout.jpg",
	articleImage2: "img/aircraft/b1b/b-1_03.jpg"
},
{
	articleTitle: "Ту-95МС (Bear)",
	articleText: "Он старый, медленный, турбовинтовой и очень шумный. Его может засечь любой радар на большой дальности, но «Ту-95МС» это нисколько не смущает — самолет вооружен крылатыми ракетами Х-55 с ядерной боевой частью, которые могут поражать цели на дистанции в 3000 км (модификация СМ). Поэтому входить в зону ПВО противника «Медведю» не обязательно. Тихоходный — всего 830 км/ч — бомбардировщик «Ту-95МС» обладает высокой дальностью полета (порядка 11 тыс. км и потолком в 12 тыс. метров). За 17 часов полета «Медведь» расходует 96 тонн авиационного керосина.",
	articleImage: "img/aircraft/tu95/tu-95-02.jpg",
	articleImage2: "img/aircraft/tu95/tupolev_tu-95_in_flight.jpg"
},
{
	articleTitle: "Northrop B-2 Spirit",
	articleText: "Стратегический стелс-бомбардировщик Northrop B-2 Spirit — самый дорогой самолет за всю историю военной авиации. В ценах 1997 года он стоил порядка двух миллиардов долларов. Крейсерская скорость полета стелс-бомбардировщика невысока — всего 800 км/ч, зато он обладает высокой дальностью полета — 11 тыс. км и потолком в 15 тыс. метров. Самолет способен брать на борт 16 атомных бомб B-61, или 8 управляемых 907 кг бомб с лазерным наведением GBU-27 Paveway II, или 80 бомб калибра 227 кг.",
	articleImage: "img/aircraft/b2/b2_spirit_.jpg",
	articleImage2: "img/aircraft/b2/northrop_b-2_spirit_us.jpg"
},
{
	articleTitle: "B-52 — «Stratofortress»",
	articleText: "Стратегические бомбардировщики B-52 «Stratofortress» можно справедливо назвать ветеранами: первый 52-й поднялся в воздух в 1952 году, а последний покинул конвейер в 1963 году. ВВС США планируют сохранить этот самолет на вооружении до 2040 года. Бомбардировщик дозвуковой, его максимальная скорость 960 км/ч, дальность полета 16 700 км, а потолок — порядка 16 тыс. метров. B-52 «Stratofortress» может нести 27 тонн боевой нагрузки. Бомбардировщик активно применялся в ходе последних боев в Афганистане и Ираке, где успешно справлялся с боевыми задачами.",
	articleImage: "img/aircraft/b52/boeing-b-52-stratofortress1.jpg",
	articleImage2: "img/aircraft/b52/b-52h_static_display_arms_06.jpg"
},
{
	articleTitle: "Ту-160 (Blackjack)",
	articleText: "Ту-160 — самый крупный сверхзвуковой самолет в истории военной авиации, самолет с изменяемой геометрией крыла, а также мощнейший и самый тяжелый боевой самолет в мире. По скорости он может тягаться с истребителем — 2300 км/ч, может нести до 54 тонн бомб и ракет, обладая максимальной дальностью полета в 13 950 км. В свое время этими сильнейшими самолетами располагали ВВС Украины, однако они были уничтожены по инициативе Вашингтона, также были уничтожены все запасы крылатых ракет X-55 c ядерной БЧ.",
	articleImage: "img/aircraft/tu160/18-28-51-2649195.jpg",
	articleImage2: "img/aircraft/tu160/tu-160_24.jpg"
}
];
 
let ul   = 	document.querySelector(".menu");
let h2   = 	document.querySelector('.article-title');
let p1   = 	document.querySelector('.article-text');
let img  = 	document.querySelector('.article-image[data-img="1"]');
let img2 = 	document.querySelector('.article-image[data-img="2"]');

let showPage = (page) => {
	document.title = page.articleTitle;
	h2.textContent = page.articleTitle;
	p1.textContent = page.articleText;
	img.src = page.articleImage;
	img2.src = page.articleImage2;
}

ul.addEventListener( 'click', e => {
	document.querySelector(".active").classList.remove("active");
	e.target.classList.add("active");
	
	let searchPage = (el, i, arr) => {
		if(e.target.textContent == el.articleTitle)
		return el;
	}
	
	showPage(pages.find(searchPage));
	
});
 