const FirstInfo = 
{
	image: "image/StarCraft.jpg",
	text: "<p><b>StarCraft</b> имеет сходства с предыдущей игрой компании Blizzard Entertainment, Warcraft II, как в названии игры, так и в геймплее.</p><p>Стороны конфликта представлены тремя игровыми расами: терранами, протоссами и зергами. Одним из важнейших новшеств игры является различие между воюющими сторонами при соблюдении баланса сил. StarCraft — одна из первых стратегий в реальном времени, в которой каждая сторона отличается не только внешним видом, но и характеристиками своих представителей, а также общей стратегией боя. Протоссы располагают мощными, но дорогостоящими воинами и техникой, а зерги превосходят противника за счёт численности и скорости. При прочих равных условиях ни у одной расы нет весомого преимущества перед другой[9]. К таким условиям можно отнести количество и расположение ресурсов в непосредственной близости к первой базе, оборонительные условия местности, расположение по отношению к другим игрокам.</p><p> В режиме многопользовательской игры можно играть по локальной сети (LAN), модему или подключившись к бесплатному официальному игровому серверу Blizzard Entertainment под названием Battle.net. Также есть возможность сражений с компьютерным оппонентом. Условия игры можно подобрать в соответствии со своим опытом. Игроки, при необходимости, могут отредактировать карты в редакторе StarEdit, чтобы дать себе или компьютеру преимущество. Через несколько лет после выхода игры Blizzard выпустила также несколько карт повышенной сложности. Со временем патчи также усовершенствовали интеллект компьютерного оппонента.</p>"
};
const gamePlayInfo = 
{
	image: "image/gamePlay2.jpg",
	text: "<p><b>Карта</b></p><p>Процесс отдельной игры разворачивается на карте, размеры которой могут значительно варьироваться для разных миссий (минимальный размер: 64×64), на которой могут присутствовать земля, в том числе с перепадами высот, непроходимые скалы, водные преграды и участки свободного космического пространства. По земле могут перемещаться наземные юниты, и на ней могут строиться здания. На начало игры карта скрыта туманом войны; разведанная местность после ухода юнитов остаётся видимой, но на ней не видны происходящие впоследствии перемещения и постройки. Преодолевать водные преграды и космическое пространство могут только летающие юниты, в том числе и транспортные, перевозящие наземных. Большинство наземных юнитов у зергов могут прятаться под поверхностью земли, при этом они не мешают движению других наземных юнитов. Некоторые здания у терранов могут взлетать и перемещаться на новое место, но в ходе перемещения не могут функционировать. Деятельность игроков в ходе игры заключается в добыче ресурсов, возведении зданий, строительстве юнитов и ведении боевых действий против юнитов и зданий противников; в кампаниях может требоваться также выполнение отдельно сформулированных заданий.</p><p><b>Экономика и сражения</b></p><p>В игре имеется два типа добываемых ресурсов: минералы и газ веспен. Минералы представляют собой скопления голубоватых кристаллов и добываются непосредственно из месторождений, а для добычи газа необходимо построить над источником специальное здание. После того, как источник иссякает, игрок может неограниченно долго собирать остатки газа; но скорость выработки падает в 4 раза. При этом месторождения минералов вырабатываются полностью. Ресурсы добываются специальными юнитами. Чем технологически сложнее единица или здание, тем больше требуется минералов и газа для его производства.</p><p>Кроме того, существует параметр, ограничивающий допустимое количество боевых единиц на поле боя. У разных рас он называется по-разному («снабжение» у терранов, «контроль» у зергов и «пси-энергия» у протоссов). Зерги уникальны сразу в двух отношениях: во-первых, за «контроль» ответственны не здания, а подвижные юниты-«надзиратели»; во-вторых, только у зергов есть подразделения, которые требуют меньше одной единицы контроля (зерглинги и «слепни» создаются сразу по два экземпляра, расходуя одну единицу). Действует также общее ограничение: нельзя иметь более 200 единиц снабжения/контроля/пси. Эти ограничения не суммируются, то есть можно располагать 200 единицами снабжения и 200 единицами контроля одновременно в случае управления силами двух рас.</p><p>У юнитов имеется три параметра:</p><p>очки жизни (англ. hit points) обязательные для всех;</p><p>очки энергии (англ. energy points) отсчитывающие особые умения и эффекты у отдельных юнитов;</p><p>очки силового поля (англ. shield points) у протоссов.</p><p>При атаке на юнит у него убывают очки жизни; юнит уничтожается, когда его очки жизни падают до нуля. У терранов восстановлением зданий и техники занимаются ресурсодобывающие модули КСМ, восстановлением здоровья пехоты — «медики». У протоссов получаемые повреждения сначала вычитаются из очков силового поля, пока те не падают до нуля, после чего повреждения начинают вычитаться из очков жизни. Очки энергии и очки силового поля протоссов постоянно восстанавливаются, очки жизни — нет. У зергов очки жизни самовосстанавливаются. «Осквернитель» зергов и уникальный юнит «Заражённая Керриган» имеют уникальную способность «Поглощение» — уничтожение любого юнита зергов, кроме личинки, с мгновенным восстановлением 50 очков энергии. Ни один другой игровой юнит столь быстро восстанавливаться не может.</p><p>Единицы делятся на наземные и воздушные. Некоторые единицы не могут атаковать какую-либо из групп (например, огнемётчик не может атаковать воздушные единицы), а у некоторых — атака наземных и летающих целей производится разными типами вооружения. Ракетная турель терранов может атаковать только летающие цели, а летающий «страж» зергов атакует только наземные цели. В «StarCraft: Brood War» у всех рас появляются летающие единицы, атакующие только летающие цели (истребители).</p>"
};

const racePlayInfo =
{
	image: "image/races.jpg",
	text: "<p>Э. Роллингз и Д. Моррис считают, что расы в игре имеют подсмыслы в идеях Фрейда: терраны символизируют собой «я», протоссы — «сверх-я», а зерги — «оно».</p> <p><b>Терраны</b> — люди, потомки землян, сосланных в качестве преступников колонизировать новые планеты и попавших в сектор Копрулу из-за поломки навигационных компьютеров их кораблей. Терраны быстро колонизировали планеты, на которые попали, и заселили несколько других миров. В ходе междоусобных войн терраны сильно развились в военном плане, делая основную ставку на уничтожение противника на расстоянии. Пехота терранов облачена в тяжёлые скафандры, защищающие её от пуль, снарядов, радиации, а также биологического и химического оружия. Наземная техника представлена танками, способными превращаться в неподвижные артиллерийские орудия, шагающими аппаратами поддержки пехоты («голиафы») и скоростными байками-антигравами («стервятники»). Кроме того, терраны обладают несколькими уникальными технологиями — тактическими и стратегическими ядерными ракетами, элитными отрядами солдат-псиоников в маскировочных костюмах («призраки») и ударной волной ЭМИ, способной мгновенно лишить противника энергии и силового поля. Поскольку в новых условиях мобильность стала залогом выживания, многие терранские здания способны к медленному перемещению по воздуху. Все здания и механические юниты терранов ремонтопригодны (но на проведение ремонта тратится некоторое количество ресурсов).</p> <p><b>Про́тоссы</b> — раса, обладающая природными пси-способностями, и некогда сильно развитая древней расой зел-нага в ходе эксперимента. В прошлом протоссы пережили эпоху Раздора — длительную гражданскую войну, сильно отбросившую их в развитии и вместе с этим определившую их современные традиции и культуру. Общество протоссов разделено на кланы и касты и довольно традиционно. Протоссы обладают самыми развитыми технологиями по сравнению с зергами и терранами; их рода войск мощнее, чем аналогичные у других рас, но вместе с тем их армии немногочисленны. Все здания и войска призываются из родного мира протоссов через врата искривления и должны находиться в поддерживающем поле пилонов, аккумулирующих пси-энергию (при уничтожении пилонов здания перестают функционировать вплоть до постройки нового пилона поблизости).</p> <p><b>Зе́рги</b> — раса, созданная из различных видов насекомых древней расой зел-нага после того, как те не удовлетворились результатами эксперимента с протоссами. Техника у зергов отсутствует вовсе, но чрезвычайно развиты биотехнологии — живыми организмами являются все «здания» и «механизмы». Большая часть расы не обладает разумом, оставаясь на уровне животных, разумными является относительно небольшой ряд особей, которые управляют всей совокупностью зергов — роем, состоящим из стай. Общее управление роем осуществляет сверхразум зергов через представителей следующей ступени иерархии — церебралов, каждый из которых управляет конкретной стаей. Церебралам помогают управлять стаей подчиненные им, но тоже разумные «надзиратели» и «королевы». Отряды зергов в основном ориентированы на ближний бой. По отдельности они слабы и поэтому зерги предрасположены атаковать большими группами. Живые постройки этой расы можно создавать на специальной биологической материи — «слизи», распространяющейся вокруг инкубаторов и колоний. Для выращивания инкубаторов и экстракторов по переработке газа «слизь» не обязательна. В отличие от инфраструктур протоссов, для функционирования которых необходимы пилоны, здания зергов продолжают функционировать, даже если «слизь» вокруг них исчезает. Все юниты и постройки зергов имеют способность к постепенной регенерации после получения нелетальных повреждений. «Королевы» зергов способны заразить повреждённые командные центры терранов, что даёт возможность производить в них заражённых терранов-пехотинцев. После выхода StarCraft зерги стали одной из наиболее известных рас в компьютерных играх. Журнал PC Gamer UK назвал зергов «лучшей расой в истории стратегий».</p>"
};
const plotInfo =
{
	image: "image/Plot.jpg",
	text: "<p><b>Эпизод I («Призыв к мятежу»)</b></p><p>Действие игры начинается в 2499 году в секторе Копрулу, когда терраны сталкиваются с неизвестными доселе враждебными существами — зергами. При этом Конфедерация, доминирующее в секторе государство терран, отказывает в помощи мирным жителям одной из своих планет, Мар-Сары, эвакуируя лишь войска. Тогда инициативу по защите планеты берет в свои руки её новоназначенный магистр (в его роли выступает игрок) и местный шериф Джим Рейнор. После того, как они уничтожают заражённый зергами терранский командный центр, правительство объявляет Рейнора изменником и арестовывает. На свободу Джима выпускает повстанческая организация «Сыны Корхала», целью которой является свержение тирании Конфедерации. К «Сынам Корхала» присоединяется также магистрат и генерал Конфедерации Эдмунд Дюк.</p><p>Начинается Первая Галактическая война. В ходе последовавших вооружённых столкновений обнаруживается, что зергов на терранские планеты привлёк пси-излучатель — устройство, которое агенты Конфедерации использовали, чтобы заманить зергов на неугодные режиму колонии. Затем основные силы Конфедерации должны были вступить в бой с «неизвестным врагом» и «освободить» поражённые миры. Однако дело приняло неожиданный оборот, когда в бой вступила третья сторона — протоссы. Их флот, оснащённый технологиями, далеко превосходящими терранские, следовал к заражённым зергами колониям терран и подвергал их массированной орбитальной бомбардировке, уничтожая там всё живое.</p><p>«Сыны Корхала» находят чертежи для производства пси-излучателей, и устанавливают несколько экземпляров на густонаселённых планетах Конфедерации, включая её столицу, Тарсонис. В результате, основные силы и миры Конфедерации были сокрушены нескончаемыми атаками привлечённых пси-излучателями зергов, а оставшиеся терранские поселения перешли под контроль «Сыновей Корхала», выступивших в роли защитников человечества от инопланетной угрозы, и основавших на обломках Конфедерации новый государственный строй — Доминион.</p><p>Все это время командующий флотом протоссов Тассадар, следуя приказу своего правительства, Конклава, выжигал зараженные зергами планеты одну за другой. Однако во время битвы за Тарсонис он попытался спасти людей, высадив десант на космическую платформу «Новый Геттисберг», на которой располагался главный Улей зергов, с целью уничтожить его и не дать зергам полностью разрушить Тарсонис.</p><p>Это шло вразрез с планами лидера «Сыновей Корхала» Арктура Менгска, который желал полного уничтожения всего, что стояло на его пути к власти («Не стоит меня останавливать, Джим. Меня никто не остановит: ни вы, ни Конфедерация, ни протоссы — никто! Я буду управлять этим сектором или сожгу его дотла»). Он послал на ту же платформу Сару Керриган — свою ближайшую помощницу, с приказом помешать силам протоссов уничтожить зергов.</p><p>Посланный Тассадаром десант отступил, чем воспользовались зерги, атаковавшие позиции терран с тыла. Отряд Керриган был уничтожен после того, как Менгск проигнорировал её просьбу об эвакуации. Джим Рейнор и бывший магистрат Мар-Сары разорвали союз с Менгском и бежали с Тарсониса.</p><p><b>Эпизод II («Сверхразум»)</b></p><p>Coming soon....</p><p><b>Эпизод III («Падение»)</b></p><p>Coming soon....</p><p><b>Скрытые миссии</b></p><p>Coming soon....</p>"
};

var makeElement = function (tagName, className, text) {
	var element = document.createElement(tagName);
  	element.classList.add(className);
  	if (text) {
    	element.textContent = text;
  	}
  	return element;
};

var createCard = function (content) {
	var listItem = makeElement('div', 'div__innert');

 	var picture = makeElement('img', 'image');
  	picture.src = content.image;
  	listItem.appendChild(picture); 

  	var divElement = document.createElement('div');
	divElement.innerHTML = content.text;
	listItem.appendChild(divElement);

  	return listItem;
};

document.addEventListener("DOMContentLoaded", function() { 
	const gamePlay = document.querySelector('#gamePlay');
	const mainInformation = document.querySelector('#mainInformation');
	const racePlay = document.querySelector('#racePlayInfo');
	const plot = document.querySelector('#plotInfo');
	var foo = document.getElementById('section');
	//for side bar
	var menu = document.querySelector('#menu');
    var drawer = document.querySelector('.sidebar');
	
	//side bar	
	menu.addEventListener('click', function() {
		drawer.classList.toggle('active')
	});

	//FirstPage
	function FirstPage () {
	var cardItem = createCard(FirstInfo);

	foo.appendChild(cardItem);
	}
	FirstPage ();

	//add pages by click
	gamePlay.addEventListener('click', function () {
		foo.innerHTML = '';

		var cardItem = createCard(gamePlayInfo);
		foo.appendChild(cardItem);
	});
	mainInformation.addEventListener('click', function () {
		foo.innerHTML = '';

		var cardItem = createCard(FirstInfo);
		foo.appendChild(cardItem);
	});
	racePlay.addEventListener('click', function () {
		foo.innerHTML = '';

		var cardItem = createCard(racePlayInfo);
		foo.appendChild(cardItem);
	});
	plot.addEventListener('click', function () {
		foo.innerHTML = '';

		var cardItem = createCard(plotInfo);
		foo.appendChild(cardItem);
	});
});


	  