{
    "action-menu__list-items": [
        "<li class=\"action-menu__list-item \"><h2 class=\"action-menu__item-header\">Carrot cake sweet roll.</h2></li>",
        "<li class=\"action-menu__list-item action-menu__list-item_state_active\"><h2 class=\"action-menu__item-header\">Powder oat cake marzipan brownie cake lollipop</h2></li>",
        "<li class=\"action-menu__list-item \"><h2 class=\"action-menu__item-header\">Sweet roll soufflé dragée chocolate cake.</h2></li>",
        "<li class=\"action-menu__list-item\"><h2 class=\"action-menu__item-header\">Wafer carrot cake halvah pudding danish apple pie </h2></li>",
        "<li class=\"action-menu__list-item\"><h2 class=\"action-menu__item-header\">Marshmallow gummi bears</h2></li>"
    ],
    "action-menu__content-items": [
        "<li class=\"action-menu__content-item\"><img class=\"action-menu__item-img\" src=\"img/blue_muffin.png\" alt=\"cake-image\"><p class=\"action-menu__item-text\">Carrot cake sesame snaps sweet roll. Chocolate bar sugar plum dessert tart.Macaroon lemon drops jelly chocolate cake tootsie roll pie cake. Pie tiramisu cake chupa chups ice cream. Chupachups carrot cake toffee biscuit sweet powder jelly-o macaroon. Dessert gingerbread carrot cake chocolate caketoffee carrot cake dessert biscuit jelly-o. Donut topping biscuit sesame snaps soufflé cheesecake cookie chupachups. Candy jelly beans cake macaroon cake topping.</p><p class=\"action-menu__item-text\">Tiramisu dragée danish. Halvah pudding sweet roll gingerbread. Candy cookieicing. Fruitcake caramels tiramisu. Macaroon gummi bears sweet roll sesame snaps marzipan brownie apple piedonut. Danish oat cake brownie jujubes croissant. Wafer sweet carrot cake cookie carrot cake sweet roll.Lollipopgummi bears gummi bears lemon drops. Chocolate fruitcake cake topping dragée.</p><p class=\"action-menu__item-text\">Halvah donut cupcake dragée halvah cake. Oat cake carrot cake ice cream gummiesoat cake marshmallow lollipop jelly. Ice cream fruitcake soufflé. Caramels carrot cake cupcake bear claw. Gummibears topping candy canes wafer candy canes topping cookie bonbon. Pastry gingerbread tootsie roll caramelscarrot cake marshmallow pie. Sweet roll soufflé dragée chocolate cake.</p></li>",
        "<li class=\"action-menu__content-item action-menu__content-item_state_active\"><img class=\"action-menu__item-img\" src=\"img/green_muffin.png\" alt=\"cake-image\"><p class=\"action-menu__item-text\">Macaroon dessert lollipop caramels sweet roll chocolate bar cotton candy. Tarticing caramels cheesecake pie lollipop gummies cake tart. Liquorice toffee marzipan sweet lemon drops cookiefruitcake topping. Pudding tiramisu toffee fruitcake pie topping icing. Soufflé jelly-o cake soufflé danish cakecroissant. Dragée biscuit bonbon soufflé.</p><p class=\"action-menu__item-text\">Brownie macaroon tiramisu sugar plum cookie. Sweet roll tart sesame snapstootsie roll carrot cake bear claw ice cream cake gummi bears. Powder chupa chups lollipop cake jelly. Dragéechocolate bar wafer pastry soufflé jelly-o. Cake caramels jelly-o gummies sweet fruitcake gummies. Puddingdragéecaramels jujubes pastry ice cream chocolate. Powder soufflé gingerbread dessert.</p><p class=\"action-menu__item-text\">Pastry marzipan cake powder chupa chups bear claw chocolate cake. Cookie candyapple pie liquorice gingerbread tart pastry. Candy canes apple pie danish toffee jelly wafer cupcake. Cheesecakecaramels chocolate cake sesame snaps chupa chups jelly beans halvah. Candy croissant toffee jujubes. Oat cakepowder gummi bears carrot cake macaroon bonbon jelly beans. Cake chocolate cake jelly beans ice creamgingerbreadchocolate cake oat cake jujubes. Cotton candy oat cake toffee pudding topping macaroon.</p></li>",
        "<li class=\"action-menu__content-item\"><img class=\"action-menu__item-img\" src=\"img/happy_muffin.png\" alt=\"cake-image\"><p class=\"action-menu__item-text\">Powder oat cake marzipan brownie cake lollipop chupa chups lemon drops chupachups. Ice cream tiramisu candy macaroon bonbon. Gummies fruitcake candy canes danish. Gummi bears fruitcakebrownie marshmallow fruitcake jelly beans wafer. Gingerbread apple pie oat cake bear claw gingerbread. Toppingmarshmallow pudding pudding cheesecake croissant tart pudding. Cake tart lollipop gingerbread lollipop cookiebiscuit sesame snaps pie. </p><p class=\"action-menu__item-text\">Cookie chocolate cake gummies. Chocolate cake lemon drops cake cupcake cakebonbon wafer. Donut muffin cheesecake marshmallow gummies icing icing caramels. Halvah ice cream carrot cakejelly dragée pudding jelly beans cookie. Dessert bear claw jujubes soufflé fruitcake pie bear claw. Dessertwaferdragée icing chocolate bar tart. Tiramisu liquorice lollipop candy canes chocolate bar. Tootsie roll sesamesnapsjelly-o chupa chups liquorice. Pastry toffee macaroon sesame snaps gummi bears bear claw brownie.</p><p class=\"action-menu__item-text\">Cheesecake tootsie roll jelly beans pastry croissant wafer. Chupa chups icecream danish biscuit. Jelly macaroon donut lemon drops gingerbread jelly beans powder. Danish jelly bear clawbrownie bonbon sugar plum pie bonbon. Oat cake pie tiramisu. Sugar plum bear claw halvah fruitcake dessert icecream cookie liquorice. Marzipan carrot cake powder.</p></li>",
        "<li class=\"action-menu__content-item\"><img class=\"action-menu__item-img\" src=\"img/light_brown_muffin.png\" alt=\"cake-image\"><p class=\"action-menu__item-text\">Wafer carrot cake halvah pudding danish apple pie jelly beans marshmallowchocolate cake. Dragée dragée gummies cake. Gummies lemon drops halvah icing marzipan sesame snaps candy caneschocolate bar. Fruitcake candy canes tootsie roll. Toffee gummies chupa chups chocolate donut jujubes oat cakeapple pie. Gummi bears oat cake halvah liquorice cookie wafer. Candy canes jujubes dragée jelly-o marshmallowtootsie roll liquorice chocolate bar biscuit.</p><p class=\"action-menu__item-text\">Tiramisu lollipop danish sesame snaps sweet roll chocolate bar caramels gummiescandy canes. Marshmallow ice cream apple pie pie dessert. Chocolate danish cake dragée donut soufflé ice creamsugar plum sesame snaps. Oat cake cake pudding. Donut bonbon macaroon toffee gummi bears macaroon. Apple pietartpastry toffee candy canes halvah fruitcake. Halvah bear claw pudding pie. Lemon drops lollipop gummies jellybeans. Bonbon fruitcake muffin sweet gummi bears ice cream jelly bear claw. Toffee oat cake jujubes chupa chupssugar plum.</p><p class=\"action-menu__item-text\">Marzipan gummi bears liquorice liquorice apple pie. Cake chocolate bar danishmarshmallow jelly beans cupcake tiramisu. Cookie liquorice powder lollipop jelly biscuit apple pie. Sweet waferwafer chocolate muffin macaroon. Jelly beans croissant jujubes gummi bears. Liquorice wafer tiramisu. Ice creamgummies tart soufflé sweet muffin wafer. Wafer brownie liquorice brownie sugar plum lemon drops gingerbreadcheesecake. Chocolate bar candy canes jelly chocolate cake cake powder.</p></li>",
        "<li class=\"action-menu__content-item\"><img class=\"action-menu__item-img\" src=\"img/pink_muffin.png\" alt=\"cake-image\"><p class=\"action-menu__item-text\">Marshmallow gummi bears ice cream sugar plum ice cream sweet oat cake gummibears donut. Chocolate croissant biscuit halvah pudding cupcake gummies. Brownie sweet macaroon brownie toppingcaramels tootsie roll cupcake. Fruitcake jujubes chocolate cake. Chocolate bar halvah bonbon sesame snapsgingerbread fruitcake gingerbread jujubes gummies. Brownie fruitcake cake chocolate bar lemon drops chupa chupschocolate bar soufflé. Cotton candy marshmallow topping biscuit croissant pastry.</p><p class=\"action-menu__item-text\">Gummi bears gummi bears lollipop danish tart soufflé powder cupcake. Bonbonlemon drops tiramisu sweet roll lemon drops. Cake caramels cookie cake halvah gummi bears croissant pie. Toppingtopping topping pudding oat cake jelly-o jujubes powder. Lollipop cupcake biscuit caramels oat cake tiramisu.Cake jelly beans topping chocolate bar toffee liquorice oat cake donut. Lollipop powder bonbon wafer cupcakemarzipan. Lollipop dragée cheesecake lemon drops cheesecake. Powder soufflé cheesecake chocolate cake chocolate.</p><p class=\"action-menu__item-text\">Pastry cupcake marzipan cookie sugar plum croissant soufflé. Jujubes muffindessert. Powder chocolate cake icing cotton candy marzipan pudding topping. Apple pie lemon drops lemon drops.Pastry dragée tiramisu chocolate bar. Gingerbread donut fruitcake. Donut chocolate icing powder ice cream muffincheesecake carrot cake. </p></li>"
    ]
}